app/views/articles/index.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 2]]
---
					%span
						= User.find(article.author_id).email
				.tags_articles.col.m10.s12.offset-m1
					= raw article.tags.map(&:name).map{ |t| link_to t, tag_path(t)}.join(' ')
			.text.row
				.links.col.m10.s12.offset-m1
					.date.right