app/views/articles/show.html.haml

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
			Коментарии
		- @article.comments.each do |comment|
			%h5
				= User.find(comment.user_id).email