app/views/tags/show.html.haml

SELECT  1 AS one FROM "articles" INNER JOIN "taggings" ON "articles"."id" = "taggings"."article_id" WHERE "taggings"."tag_id" = ? LIMIT ?  [["tag_id", 3], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" INNER JOIN "taggings" ON "articles"."id" = "taggings"."article_id" WHERE "taggings"."tag_id" = ? ORDER BY "articles"."id" DESC  [["tag_id", 3]]
---
		= @tag.name
	- if @tag.articles.empty?