app/controllers/articles_controller.rb

  def index
    @articles = Article.where(:visible => true).paginate(page: params[:page], :per_page => 5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."visible" = ? ORDER BY "articles"."id" DESC LIMIT ? OFFSET ?  [["visible", "t"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."visible" = ?  [["visible", "t"]]

  def draft
    @meta_title  = meta_title 'Мои статьи'
    @articles = Article.paginate(page: params[:page], :per_page => 5)
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def create
    @article = Article.new(article_params)
    @article.author_id = current_user.id

    if params[:draft]
      @article.visible = false
    end

    if @article.save && @article.visible == false
---
INSERT INTO "articles" ("title", "body", "author_id", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "123"], ["body", "<div>123</div>"], ["author_id", 1], ["author", "123"], ["created_at", "2019-10-19 10:30:34.565518"], ["updated_at", "2019-10-19 10:30:34.565518"]]

  def update
    if params[:draft]
      @article.visible = false
    else
      @article.visible = true
    end
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "[@article]123123"], ["updated_at", "2019-10-18 19:41:43.920583"], ["id", 5]]

  def destroy
    if @article.present?
      @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]